--[[
    Thank you for using our script. We are happy to have you here. If you need help, you can join our Discord server.
    https://discord.gg/zppUXj4JRm
]]

DreamLocales['ru'] = {
    ['NotifyHeader'] = '🎅 Рождество',

    ['PickupSnowball'] = '❄️ Вы подобрали %s снежков!',
    ['PickupSnowballCooldown'] = '❄️ Вы сможете снова собрать снежки через несколько секунд!',
    ['PickupSnowballLimit'] = '❄️ Вы достигли предела снежков!',
    ['PickupSnowballHelpNotify'] = 'Нажмите ~g~E~s~, чтобы собрать %s снежков!',

    ['MoneyAccount'] = {
        ['unknown'] = 'Неизвестный кошелек',
        ['cash'] = 'Наличные',
        ['money'] = 'Деньги',
        ['bank'] = 'Банк',
        ['dirty_money'] = 'Грязные деньги'
    },

    ['Weapons'] = {
        ['unknown'] = 'Неизвестное оружие',
        ['weapon_pistol'] = 'Пистолет',
    },

    ['PropPlacer'] = {
        ['Rotate'] = 'Повернуть +/-',
        ['Cancel'] = 'Отмена',
        ['Place'] = 'Поставить'
    },

    ['PropSystem'] = {
        ['TargetLabel'] = 'Ищите подарок',
        ['ProgressBar'] = '🎁 Поиск подарка',
        ['ActivityPopup'] = {
            ['snowman'] = 'Ищу подарок...'
        },
        ['Success'] = {
            ['PropSystemClaimedItem'] = '🎁 Вы нашли %sx %s',
            ['PropSystemClaimedWeapon'] = '🎁 Вы нашли %s с %s патронами',
            ['PropSystemClaimedMoney'] = '🎁 Вы нашли %s$ (%s)'
        },
        ['Error'] = {
            ['PropSystemNotFound'] = '🎁 Подарок не найден',
            ['PropSystemAlreadyClaimed'] = '🎁 Подарок уже был получен',
        }
    },

    ['ChristmasTree'] = {
        ['Decorate'] = {
            ['TargetLabel'] = 'Украшайте рождественскую елку',
            ['ProgressBar'] = '🎄 Украшение рождественской елки',
            ['ActivityPopup'] = 'Украшаю ёлку...',
        },
        ['Success'] = {
            ['ChristmasTreeDecorate'] = '🎄 Вы успешно украсили рождественскую елку и получили %s$'
        },
        ['Error'] = {
            ['ChristmasTreeInvalid'] = '🎄 Рождественская елка недействительна',
            ['ChristmasTreeAlreadyDecorated'] = '🎄 Рождественская елка уже украшена'
        }
    },

    ['ChristmasPresent'] = {
        ['Claim'] = {
            ['TargetLabel'] = 'Заберите свой подарок',
            ['ProgressBar'] = '🎁 Забираем подарок',
            ['ActivityPopup'] = 'Открываю подарок...',
        },
        ['Success'] = {
            ['ChristmasPresentItem'] = '🎁 Вы получили %sx %s',
            ['ChristmasPresentWeapon'] = '🎁 Вы получили %s с %s патронами',
            ['ChristmasPresentMoney'] = '🎁 Вы получили %s$ (%s)'
        },
        ['Error'] = {
            ['ChristmasPresentInvalid'] = '🎁 Рождественский подарок недействителен',
            ['ChristmasPresentAlreadyClaimed'] = '🎁 Рождественский подарок уже был получен'
        }
    },


    ['ChristmasSnowman'] = {
        ['Build'] = {
            ['Start'] = '❄️ Построй снеговика!',
        },
        ['Error'] = {
            ['General'] = '❄️ Сейчас нельзя построить снеговика!',
            ['AlreadyBuilding'] = '❄️ Ты уже строишь снеговика!',
            ['InPropPlacer'] = '❄️ Ты уже в режиме размещения объектов!',
            ['MaxCountReached'] = '❄️ Ты достиг максимального количества снеговиков!',
            ['NoCarrotItem'] = '❄️ У тебя нет моркови для снеговика!',
        }
    },

    ['AdventCalendar'] = {
        ['Open'] = {
            ['TargetLabel'] = 'Открыть рождественский календарь',
            ['ProgressBar'] = '🎅 Открывается рождественский календарь',
            ['ActivityPopup'] = 'Открытие календаря...',
        },
        ['Status'] = {
            ['Claimed'] = 'Получено',
            ['NotClaimed'] = 'Не получено',
        },
        ['Success'] = {
            ['AdventCalendarItem'] = '🎅 Ты получил %sx %s',
            ['AdventCalendarWeapon'] = '🎅 Ты получил %s с %s патронами',
            ['AdventCalendarMoney'] = '🎅 Ты получил %s₽ (%s)'
        },
        ['Error'] = {
            ['AdventCalendarNotToday'] = '🎅 Можно открыть только сегодняшний подарок',
            ['AdventCalendarNotDecember'] = '🎅 Календарь доступен только в декабре',
            ['AdventCalendarAlreadyClaimed'] = '🎅 Ты уже получил сегодняшний подарок',
            ['AdventCalendarNoReward'] = '🎅 Сегодня нет награды',
        }
    }
}
